# CanChangeFamilyName Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DirectShapeType..::..CanChangeFamilyName Method
DirectShapeType Class See Also
---
Checks whether the DirectShapeType supports a custom family name.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public bool CanChangeFamilyName()
```

Visual Basic
---
```text
Public Function CanChangeFamilyName As Boolean
```

Visual C++
---
```text
public:
bool CanChangeFamilyName()
```

# ### Return Value
True if a custom family name is supported, false otherwise.
# See Also
DirectShapeType Class
Autodesk.Revit.DB Namespace